Documents/ПроверкаКачестваТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПроверкаКачестваТоваров</Name>
			<BasedOn>
				<xr:Item>Document.ЗаданиеЛаборатории</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.АК_РассылкиПоставщикамТехнологам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГруппыПоказателей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПовторнойПроверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПрикрепления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавилПротокол</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаданиеЛаборатории</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаОтвета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаОтветаСРасширением</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаСРасширением</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лаборатория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Нарушения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассылкаОбОтсутствииОтветаПоставщика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СделанаРассылка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЖурналаПроверкиКачестваТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Технолог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИсследования_Удалить</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипИсследованияПоказателейКачества</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПросмотреноПоставщиком</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетОбязательногоОтветаПроизводителя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоОтбораОбразца</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроизводстваОбразца</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемператураОбразца</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦельИсследования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГосударственныеСтандартыИТехническиеУсловия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатИсследования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПротокола</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПротокола</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заключение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставПоказателей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиКачестваПродукции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаОт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Нарушение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Маркер</Name>
							<Type>
								<v8:Type>cfg:EnumRef.МаркерыДляАудита</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПоказателиПроверки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПоказательПроверки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиПроверки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТипыИсследований</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипИсследования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипИсследованияПоказателейКачества</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОрганолептическиеПоказатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиКачестваПродукции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребованияПоНД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФизикоХимическиеПоказатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиКачестваПродукции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормативныйДокумент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГосударственныеСтандартыИТехническиеУсловия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребованияПоНД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отклонение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФайлыПроизводителя</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаДобавления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СоответствиеВебПользователейЛабораториям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеВебПользователейЛабораториям</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Лаборатория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПроверкаКачестваТоваров/Forms/ФормаСпискаУпр/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ПолучитьЛабораториюДляПользователя()
	Возврат РегистрыСведений.СоответствиеВебПользователейЛабораториям.ПолучитьТекущуюЛабораторию();
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//+++АК VERN 20161003 ИП-00013751.001.00000001
	//исключаем отбор по лаборатории для некоторых сотрудников
	Если НЕ ДополнительныеИнструментыCRM тогда
	//---АК VERN 20161003 ИП-00013751.001.00000001
	
		// Если пользователь зашел через веб-клиента, то наложим отбор только по его лаборатории
		#Если ВебКлиент ИЛИ ТонкийКлиент Тогда
		
		Если НЕ ЭтоПоставщик Тогда
			ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			
			ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Лаборатория");
			ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.Использование 	= Истина;
			ЭлементОтбора.ПравоеЗначение 	= ПолучитьЛабораториюДляПользователя();
			ЭлементОтбора.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		КонецЕсли;
		
		#КонецЕсли
		
	//+++АК VERN 20161003 ИП-00013751.001.00000001
	//исключаем отбор по лаборатории для некоторых сотрудников
	КонецЕсли;
	//---АК VERN 20161003 ИП-00013751.001.00000001
	
	//+++АК KIRN 2018.02.28 ИП-00018031  
	ВключитьОтборСпискаНаКлиенте(флТолькоПоследние6Месяцев);
	//---АК KIRN 	
КонецПроцедуры

//+++АК VERN 20161003 ИП-00013751.001.00000001
//исключаем отбор по лаборатории для некоторых сотрудников
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДополнительныеИнструментыCRM = РольДоступна("АК_ДополнительныеИнструментыCRM")
									ИЛИ РольДоступна("ПолныеПрава");
	
	//+++АК SHEP 20170803 ИП-00016394
	УстановитьПривилегированныйРежим(Истина);
	ТекущийПоставщик = ПараметрыСеанса.ТекущийКонтрагент;
	ЭтоПоставщик = ЗначениеЗаполнено(ТекущийПоставщик);
	
	Если ЭтоПоставщик Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьНедоступныйЭлементОтбора(Список.Отбор, "Производитель", ТекущийПоставщик);
	КонецЕсли;
	//---АК SHEP 20170803
	
	//+++АК LAGP 2018.04.14 ИП-00018390 Добавление кнопок отбора
	Если РольДоступна("ПолныеПрава") ИЛИ РольДоступна("ПроверкаКачестваТоваров") ИЛИ РольДоступна("ПроверкаКачестваТоваровВебКлиент") Тогда
		Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтобратьВкусвиллБезФайлов.Видимость = Истина;
		Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтобратьВкусвиллСФайлами.Видимость  = Истина;
		Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтобратьНеВкусвилл.Видимость        = Истина;
	КонецЕсли;	
	//---АК LAGP
	
КонецПроцедуры
//---АК VERN 20161003 ИП-00013751.001.00000001


&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Если ЭтоПоставщик Тогда
		Отказ = Истина;
		ПоказатьОповещениеПользователя("Запрещено добавлять записи!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	Если ЭтоПоставщик Тогда
		Отказ = Истина;
		ПоказатьОповещениеПользователя("Запрещено удалять записи!");
	КонецЕсли;
КонецПроцедуры

//+++АК KIRN 2018.02.28 ИП-00018031       
&НаКлиенте
Процедура ОтобратьПоследние(Команда)
	флТолькоПоследние6Месяцев = Не флТолькоПоследние6Месяцев;
	ВключитьОтборСпискаНаКлиенте(флТолькоПоследние6Месяцев);
КонецПроцедуры
//---АК KIRN ИП-00018031      

//+++АК KIRN 2018.02.28 ИП-00018031  
&НаКлиенте 
ПРоцедура ВключитьОтборСпискаНаКлиенте(Вкл = ложь)
	Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтобратьПоследние.Пометка = Вкл;
	ВключитьОтборСписка(Вкл);
КОнецПроцедуры
//---АК KIRN 


//+++АК KIRN 2018.02.28 ИП-00018031        
&НаСервере
Процедура ВключитьОтборСписка(Вкл = Ложь)
	//Если Не Вкл ТОгда
	//	Возврат;
	//КонецЕСли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ДатаПрикрепления", ДобавитьМесяц(ТекущаяДата(),-6),ВидСравненияКомпоновкиДанных.БольшеИлиРавно, , Вкл);
	//ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаПрикрепления");
	//ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	//ЭлементОтбора.ПравоеЗначение = ДобавитьМесяц(ТекущаяДата(),-6);;
	//ЭлементОтбора.Использование = Истина;
КонецПРоцедуры
//---АК KIRN 

//+++АК KIRN 2018.02.28 ИП-00018031        
&НаСервере
Функция ПолучитьСтруктуруСвойствСтрокНаСервере(мСтроки)
	мСтруктурыСвойствСтрок = Новый Массив;
	ДЛя Каждого Стр из мСтроки Цикл
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("ИмяФайлаСРасширением", Стр.ИмяФайлаСРасширением);
		СтруктураДанных.Вставить("ИмяФайла",Стр.ИмяФайла);
		СтруктураДанных.Вставить("АдресФайла",ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(Стр.ИмяФайла), Новый УникальныйИдентификатор()));
		СтруктураДанных.Вставить("Ссылка",Стр.Ссылка);
		мСтруктурыСвойствСтрок.Добавить(СтруктураДанных);
	КонецЦикла;
	Возврат мСтруктурыСвойствСтрок;
КонецФункции
//---АК KIRN 


//+++АК KIRN 2018.02.28 ИП-00018031        
&НаКлиенте
Процедура ПечататьФайлПротокола(Команда)
	
	ВыбранныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	мсСтруктурСвойств = ПолучитьСтруктуруСвойствСтрокНаСервере(ВыбранныеСтроки);
	
	ДЛя Каждого Стр из мсСтруктурСвойств Цикл
		
		Об = Стр;
		Если ПустаяСтрока(Об.ИмяФайла)Тогда
			Возврат;
		КонецЕсли;
		
		#Если Не ВебКлиент Тогда
			
			Расширение = ПроцедурыОбменаДанными.ПолучитьРасширениеИмениФайла(Об.ИмяФайлаСРасширением);
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Расширение);
			//АдресФайла = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(Объект.ИмяФайла), Новый УникальныйИдентификатор());
			//АдресФайла = ПоместитьФайлВоВременноеХранилище(Об);
			Если ПолучитьФайл(Стр.АдресФайла, ИмяВременногоФайла, Ложь) Тогда
				ЗапуститьПриложение(ИмяВременногоФайла);
			КонецЕсли;
			
		#Иначе
			
			Если НЕ ПодключитьРасширениеРаботыСФайлами() Тогда
				УстановитьРасширениеРаботыСФайлами();
			КонецЕсли;
			
			Если ПодключитьРасширениеРаботыСФайлами() Тогда
				
				//ПолучаемыйФайл = Новый ОписаниеПередаваемогоФайла(Об.ИмяФайла, ПоместитьФайлВоВременноеХранилище(Об));
				ПолучаемыйФайл = Новый ОписаниеПередаваемогоФайла(Об.ИмяФайла, Стр.АдресФайла));
				ПолучаемыеФайлы = Новый Массив;
				ПолучаемыеФайлы.Добавить(ПолучаемыйФайл);
				
				ПолученныеФайлы = Новый Массив;
				
				ДВ = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
				ДВ.Заголовок = "Укажите каталог для скачивания...";
				
				Если ПолучитьФайлы(ПолучаемыеФайлы, ПолученныеФайлы, ДВ, Истина) Тогда	
					
					ПолноеИмяФайлаНаКлиенте = ПолученныеФайлы[0].Имя;
					ДвоичныеДанные = ПолучитьИзвременногохранилища(ПолученныеФайлы[0].Хранение);
					
					ЗапуститьПриложение(ПолноеИмяФайлаНаКлиенте);
					
				КонецЕсли;
				
			Иначе
				ВызватьИсключение "Для данного браузера использование расширения для работы с файлами не поддерживается.";
				
			КонецЕсли;
			
		#КонецЕсли
	КонецЦикла;
КонецПроцедуры
//---АК KIRN

//+++АК LAGP 2018.04.14 ИП-00018390 Добавление кнопок отбора
&НаКлиенте
Процедура ОтобратьНеВкусвилл(Команда)
	
	Если Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтобратьВкусвиллБезФайлов.Пометка Тогда
		ОтобратьВкусвиллБезФайлов(Истина);	
	КонецЕсли;
	Если Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтобратьВкусвиллСФайлами.Пометка Тогда
		ОтобратьВкусвиллСФайлами(Истина);	
	КонецЕсли;
	
	Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтобратьНеВкусвилл.Пометка = НЕ Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтобратьНеВкусвилл.Пометка;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Лаборатория", КонтрагентПоКоду("000000561"), ВидСравненияКомпоновкиДанных.НеРавно, , Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтобратьНеВкусвилл.Пометка);
	
КонецПроцедуры

&НаСервере
Функция КонтрагентПоКоду(Код)
	Возврат Справочники.Контрагенты.НайтиПоКоду(Код);
КонецФункции	

//+++АК LAGP 2018.04.14 ИП-00018390 Добавление кнопок отбора
&НаКлиенте
Процедура ОтобратьВкусвиллСФайлами(Команда)
	
	Если Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтобратьВкусвиллБезФайлов.Пометка Тогда
		ОтобратьВкусвиллБезФайлов(Истина);	
	КонецЕсли;	
	Если Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтобратьНеВкусвилл.Пометка Тогда
		ОтобратьНеВкусвилл(Истина);	
	КонецЕсли;
	
	Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтобратьВкусвиллСФайлами.Пометка = НЕ Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтобратьВкусвиллСФайлами.Пометка;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Лаборатория", КонтрагентПоКоду("000000561"), ВидСравненияКомпоновкиДанных.Равно, , Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтобратьВкусвиллСФайлами.Пометка);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ИмяФайла", "", ВидСравненияКомпоновкиДанных.Заполнено, , Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтобратьВкусвиллСФайлами.Пометка);
	
КонецПроцедуры

//+++АК LAGP 2018.04.14 ИП-00018390 Добавление кнопок отбора
&НаКлиенте
Процедура ОтобратьВкусвиллБезФайлов(Команда)
	
	Если Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтобратьВкусвиллСФайлами.Пометка Тогда
		ОтобратьВкусвиллСФайлами(Истина);	
	КонецЕсли;
	Если Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтобратьНеВкусвилл.Пометка Тогда
		ОтобратьНеВкусвилл(Истина);	
	КонецЕсли;
	
	Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтобратьВкусвиллБезФайлов.Пометка = НЕ Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтобратьВкусвиллБезФайлов.Пометка;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Лаборатория", КонтрагентПоКоду("000000561"), ВидСравненияКомпоновкиДанных.Равно, , Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтобратьВкусвиллБезФайлов.Пометка);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ИмяФайла", "", ВидСравненияКомпоновкиДанных.НеЗаполнено, , Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтобратьВкусвиллБезФайлов.Пометка);
	
КонецПроцедуры
